# St7DeleteReinforcementLayout

Deletes the specified concrete reinforcement layout.

long St7DeleteReinforcementLayout(long uID, long LayoutID)

Input Parameters

uID

Strand7 model file ID.

Strand7 API Manual

LayoutID

Reinforcement layout ID.

Creep Law Definitions

Creep Law Definitions